Ran Plan for dir: `eitch-demo-atlantis-terragrunt/us-central1/services/testing-iac/bucket/testing-iac` workspace: `default`

<details><summary>Show Output</summary>

```diff
21:17:20.504 INFO   Terragrunt Cache server is listening on 127.0.0.1:37765
21:17:20.504 INFO   Start Terragrunt Cache server
21:17:20.590 INFO   Downloading Terraform configurations from tfr:///terraform-google-modules/cloud-storage/google?version=10.0.2 into ./.terragrunt-cache/BT9eEgtjHxdewZzN4j978fQ8v8k/nMzp8HmAhZY0B79QE6g812IfclE
21:17:21.618 INFO   Caching terraform providers for ./.terragrunt-cache/BT9eEgtjHxdewZzN4j978fQ8v8k/nMzp8HmAhZY0B79QE6g812IfclE/modules/simple_bucket
21:17:24.030 INFO   Cached registry.terraform.io/hashicorp/google v6.37.0 (signed by HashiCorp)
21:17:24.158 INFO   terraform: Initializing the backend...
21:17:24.381 INFO   terraform: Initializing modules...
21:17:24.385 INFO   terraform: Initializing provider plugins...
21:17:24.386 INFO   terraform: - Reusing previous version of hashicorp/google from the dependency lock file
21:17:24.392 INFO   terraform: - Installing hashicorp/google v6.37.0...
21:17:24.573 INFO   terraform: - Installed hashicorp/google v6.37.0 (unauthenticated)
21:17:24.573 INFO   terraform: Terraform has been successfully initialized!
21:17:24.573 INFO   terraform: 
21:17:24.573 INFO   terraform: You may now begin working with Terraform. Try running "terraform plan" to see
21:17:24.573 INFO   terraform: any changes that are required for your infrastructure. All Terraform commands
21:17:24.573 INFO   terraform: should now work.
21:17:24.573 INFO   terraform: If you ever set or change modules or backend configuration for Terraform,
21:17:24.573 INFO   terraform: rerun this command to reinitialize your working directory. If you forget, other
21:17:24.573 INFO   terraform: commands will detect it and remind you to do so if necessary.
21:17:25.957 STDOUT terraform: data.google_storage_project_service_account.gcs_account: Reading...
21:17:26.510 STDOUT terraform: data.google_storage_project_service_account.gcs_account: Read complete after 1s [id=service-538311360123@gs-project-accounts.iam.gserviceaccount.com]
21:17:26.558 STDOUT terraform: Terraform used the selected providers to generate the following execution
21:17:26.558 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
21:17:26.558 STDOUT terraform:   + create
21:17:26.558 STDOUT terraform: Terraform will perform the following actions:
21:17:26.558 STDOUT terraform:   # google_storage_bucket.bucket will be created
21:17:26.558 STDOUT terraform:   + resource "google_storage_bucket" "bucket" {
21:17:26.558 STDOUT terraform:       + effective_labels            = {
21:17:26.558 STDOUT terraform:           + "goog-terraform-provisioned" = "true"
21:17:26.558 STDOUT terraform:           + "owner"                      = "infrastructure"
21:17:26.558 STDOUT terraform:           + "service-name"               = "testing-iac"
21:17:26.558 STDOUT terraform:         }
21:17:26.558 STDOUT terraform:       + force_destroy               = true
21:17:26.558 STDOUT terraform:       + id                          = (known after apply)
21:17:26.558 STDOUT terraform:       + labels                      = {
21:17:26.558 STDOUT terraform:           + "owner"        = "infrastructure"
21:17:26.558 STDOUT terraform:           + "service-name" = "testing-iac"
21:17:26.558 STDOUT terraform:         }
21:17:26.558 STDOUT terraform:       + location                    = "US-CENTRAL1"
21:17:26.558 STDOUT terraform:       + name                        = "eitch-demo-atlantis-terragrunt-testing-iac"
21:17:26.559 STDOUT terraform:       + project                     = "eitch-demo-atlantis-terragrunt"
21:17:26.559 STDOUT terraform:       + project_number              = (known after apply)
21:17:26.559 STDOUT terraform:       + public_access_prevention    = "inherited"
21:17:26.559 STDOUT terraform:       + rpo                         = (known after apply)
21:17:26.559 STDOUT terraform:       + self_link                   = (known after apply)
21:17:26.559 STDOUT terraform:       + storage_class               = "REGIONAL"
21:17:26.559 STDOUT terraform:       + terraform_labels            = {
21:17:26.559 STDOUT terraform:           + "goog-terraform-provisioned" = "true"
21:17:26.559 STDOUT terraform:           + "owner"                      = "infrastructure"
21:17:26.559 STDOUT terraform:           + "service-name"               = "testing-iac"
21:17:26.559 STDOUT terraform:         }
21:17:26.559 STDOUT terraform:       + time_created                = (known after apply)
21:17:26.559 STDOUT terraform:       + uniform_bucket_level_access = true
21:17:26.559 STDOUT terraform:       + updated                     = (known after apply)
21:17:26.559 STDOUT terraform:       + url                         = (known after apply)
21:17:26.559 STDOUT terraform:       + autoclass {
21:17:26.559 STDOUT terraform:           + enabled                = false
21:17:26.559 STDOUT terraform:           + terminal_storage_class = (known after apply)
21:17:26.560 STDOUT terraform:         }
21:17:26.560 STDOUT terraform:       + soft_delete_policy {
21:17:26.560 STDOUT terraform:           + effective_time             = (known after apply)
21:17:26.560 STDOUT terraform:           + retention_duration_seconds = 604800
21:17:26.560 STDOUT terraform:         }
21:17:26.560 STDOUT terraform:       + versioning {
21:17:26.560 STDOUT terraform:           + enabled = false
21:17:26.560 STDOUT terraform:         }
21:17:26.560 STDOUT terraform:       + website (known after apply)
21:17:26.560 STDOUT terraform:     }
21:17:26.560 STDOUT terraform: Plan: 1 to add, 0 to change, 0 to destroy.
21:17:26.560 STDOUT terraform: 
21:17:26.560 STDOUT terraform: Changes to Outputs:
21:17:26.560 STDOUT terraform:   + apphub_service_uri         = {
21:17:26.560 STDOUT terraform:       + location    = "us-central1"
21:17:26.560 STDOUT terraform:       + service_id  = "eitch-demo-atlantis-terragrunt-testing-iac"
21:17:26.560 STDOUT terraform:       + service_uri = (known after apply)
21:17:26.560 STDOUT terraform:     }
21:17:26.560 STDOUT terraform:   + bucket                     = {
21:17:26.560 STDOUT terraform:       + autoclass                   = [
21:17:26.560 STDOUT terraform:           + {
21:17:26.560 STDOUT terraform:               + enabled                = false
21:17:26.560 STDOUT terraform:               + terminal_storage_class = (known after apply)
21:17:26.560 STDOUT terraform:             },
21:17:26.560 STDOUT terraform:         ]
21:17:26.560 STDOUT terraform:       + cors                        = []
21:17:26.560 STDOUT terraform:       + custom_placement_config     = []
21:17:26.560 STDOUT terraform:       + default_event_based_hold    = null
21:17:26.560 STDOUT terraform:       + effective_labels            = {
21:17:26.560 STDOUT terraform:           + goog-terraform-provisioned = "true"
21:17:26.561 STDOUT terraform:           + owner                      = "infrastructure"
21:17:26.561 STDOUT terraform:           + service-name               = "testing-iac"
21:17:26.561 STDOUT terraform:         }
21:17:26.561 STDOUT terraform:       + enable_object_retention     = null
21:17:26.561 STDOUT terraform:       + encryption                  = []
21:17:26.561 STDOUT terraform:       + force_destroy               = true
21:17:26.561 STDOUT terraform:       + hierarchical_namespace      = []
21:17:26.561 STDOUT terraform:       + id                          = (known after apply)
21:17:26.561 STDOUT terraform:       + ip_filter                   = []
21:17:26.561 STDOUT terraform:       + labels                      = {
21:17:26.561 STDOUT terraform:           + owner        = "infrastructure"
21:17:26.561 STDOUT terraform:           + service-name = "testing-iac"
21:17:26.561 STDOUT terraform:         }
21:17:26.561 STDOUT terraform:       + lifecycle_rule              = []
21:17:26.561 STDOUT terraform:       + location                    = "US-CENTRAL1"
21:17:26.561 STDOUT terraform:       + logging                     = []
21:17:26.561 STDOUT terraform:       + name                        = "eitch-demo-atlantis-terragrunt-testing-iac"
21:17:26.561 STDOUT terraform:       + project                     = "eitch-demo-atlantis-terragrunt"
21:17:26.561 STDOUT terraform:       + project_number              = (known after apply)
21:17:26.561 STDOUT terraform:       + public_access_prevention    = "inherited"
21:17:26.562 STDOUT terraform:       + requester_pays              = null
21:17:26.562 STDOUT terraform:       + retention_policy            = []
21:17:26.562 STDOUT terraform:       + rpo                         = (known after apply)
21:17:26.562 STDOUT terraform:       + self_link                   = (known after apply)
21:17:26.562 STDOUT terraform:       + soft_delete_policy          = [
21:17:26.562 STDOUT terraform:           + {
21:17:26.562 STDOUT terraform:               + effective_time             = (known after apply)
21:17:26.562 STDOUT terraform:               + retention_duration_seconds = 604800
21:17:26.562 STDOUT terraform:             },
21:17:26.562 STDOUT terraform:         ]
21:17:26.562 STDOUT terraform:       + storage_class               = "REGIONAL"
21:17:26.562 STDOUT terraform:       + terraform_labels            = {
21:17:26.562 STDOUT terraform:           + goog-terraform-provisioned = "true"
21:17:26.562 STDOUT terraform:           + owner                      = "infrastructure"
21:17:26.562 STDOUT terraform:           + service-name               = "testing-iac"
21:17:26.562 STDOUT terraform:         }
21:17:26.562 STDOUT terraform:       + time_created                = (known after apply)
21:17:26.562 STDOUT terraform:       + timeouts                    = null
21:17:26.562 STDOUT terraform:       + uniform_bucket_level_access = true
21:17:26.562 STDOUT terraform:       + updated                     = (known after apply)
21:17:26.562 STDOUT terraform:       + url                         = (known after apply)
21:17:26.563 STDOUT terraform:       + versioning                  = [
21:17:26.563 STDOUT terraform:           + {
21:17:26.563 STDOUT terraform:               + enabled = false
21:17:26.563 STDOUT terraform:             },
21:17:26.563 STDOUT terraform:         ]
21:17:26.563 STDOUT terraform:       + website                     = (known after apply)
21:17:26.563 STDOUT terraform:     }
21:17:26.563 STDOUT terraform:   + name                       = "eitch-demo-atlantis-terragrunt-testing-iac"
21:17:26.563 STDOUT terraform:   + url                        = (known after apply)
21:17:26.563 STDOUT terraform: 
21:17:26.563 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
21:17:26.563 STDOUT terraform: Saved the plan to:
21:17:26.563 STDOUT terraform: ./default.tfplan
21:17:26.563 STDOUT terraform: To perform exactly these actions, run the following command to apply:
21:17:26.563 STDOUT terraform:     terraform apply "./default.tfplan"
21:17:26.615 INFO   Shutting down Terragrunt Cache server...
21:17:26.621 INFO   Terragrunt Cache server stopped

21:17:26.692 INFO   Terragrunt Cache server is listening on 127.0.0.1:46773
21:17:26.692 INFO   Start Terragrunt Cache server
21:17:27.424 INFO   Shutting down Terragrunt Cache server...
21:17:27.425 INFO   Terragrunt Cache server stopped
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d eitch-demo-atlantis-terragrunt/us-central1/services/testing-iac/bucket/testing-iac
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.eitch-consulting.com/lock?id=eitch-consulting%252Fdemo-atlantis-terragrunt%252Feitch-demo-atlantis-terragrunt%252Fus-central1%252Fservices%252Ftesting-iac%252Fbucket%252Ftesting-iac%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d eitch-demo-atlantis-terragrunt/us-central1/services/testing-iac/bucket/testing-iac
  ```
Plan: 1 to add, 0 to change, 0 to destroy.